motorstore/app/Http/Controllers/AdminController.php

    public function __construct()
    {
        $this->categories = Category::all();
        $this->branches = Branch::all();
---
select * from `categories`
select * from `branches`

    public function userpage()
    {
        $users = User::all();
---
select * from `users`

    public function productpage()
    {
        $products = Product::with([
            'category' => function ($query) {
                $query->select('id', 'catename');
            },
            'branch' => function ($query) {
                $query->select('id', 'address');
            }])->get()->toArray();
---
select `id`, `address` from `branches` where `branches`.`id` in (1, 2, 3)
select `id`, `catename` from `categories` where `categories`.`id` in (1)

    public function branchpage()
    {
        $branches = Branch::all();
---
select * from `branches`

    public function create_category()
    {
        $categories = Category::all();
---
select * from `categories`

    public function create_product()
    {
        $products = Product::all();
---
select * from `products`