motorstore/app/Http/Controllers/HomeController.php

select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 4, 5, 6)
---
    public function index()
    {
        $categories = Category::where('parent_id',0)->with('childs')->get();