motorstore/app/Http/Controllers/HomeController.php

select * from `categories`
select * from `products`
---
    public function index()
    {
        $categories = Category::all();
        $products = Product::all();